627. Обмен зарплатой  
Напишите решение для замены всех значений 'f' и 'm' (т. е. замены всех значений 'f' на 'm' и наоборот) с помощью одного оператора обновления без использования промежуточных временных таблиц.  
Обратите внимание, что для решения этой задачи вам нужно написать один оператор обновления, не нужно писать оператор выбора.

In [17]:
import pandas as pd
data = [[1, 'A', 'm', 2500], [2, 'B', 'f', 1500], [3, 'C', 'm', 5500], [4, 'D', 'f', 500]]
salary = pd.DataFrame(data, columns=['id', 'name', 'sex', 'salary']).astype({'id':'Int64', 'name':'object', 'sex':'object', 'salary':'Int64'})

In [19]:
salary

   id name sex  salary
0   1    A   f    2500
1   2    B   m    1500
2   3    C   f    5500
3   4    D   m     500

In [18]:
salary['sex'] = salary['sex'].replace({'m': 'f', 'f': 'm'})